
// &Вместо("Печать") --chernyh.su убрал после обновления 2024.03.21, была ошибка в этой процедуре
Процедура УЦ_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	РежимПечати = "";
	Если ПараметрыПечати.Свойство("РежимПечати") Тогда
		РежимПечати = ПараметрыПечати.РежимПечати;
	КонецЕсли;
	
	СтруктураНастроек = ПолучитьПустуюСтруктуруНастроек();
	СоответствиеШаблонов = Новый Соответствие;
	
	Если РежимПечати = "ПодарочныеСертификаты" Тогда
		
		СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблонаПодарочныйСертификат";
		ТекстВременнойТаблицы = "	(ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Сертификат,
		|		ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка) КАК НомерСертификата,
		|		ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация)";
		
		СтруктураНастроек.Вставить("ТекстВременнойТаблицы", ТекстВременнойТаблицы);
		
		СтруктураНастроек.ОбязательныеПоля.Добавить("Сертификат");
		СтруктураНастроек.ОбязательныеПоля.Добавить("НомерСертификата");
		СтруктураНастроек.ОбязательныеПоля.Добавить("КоличествоЭтикетокДляПечати");
		СтруктураНастроек.ОбязательныеПоля.Добавить("ШаблонЭтикеткиДляПечати");
		
		СтруктураНастроек.ПараметрыДанных.Вставить("Магазин", ПараметрыПечати.Магазин);
		
		ПечататьЭтикетки = Истина;
		ПечататьЦенники = Ложь;
		ТаблицаШаблонов = ПараметрыПечати.ПодарочныеСертификаты.Выгрузить(Новый Структура("Выбран", Истина), "ШаблонЭтикетки");
		
		Для Каждого СтрокаТЧ Из ТаблицаШаблонов Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.ШаблонЭтикетки) Тогда
				СоответствиеШаблонов.Вставить(СтрокаТЧ.ШаблонЭтикетки);
			КонецЕсли;
		КонецЦикла;
		
		// Заполняем коллекцию обязательных полей и формируем соответствие шаблонов.
		Для Каждого КлючИЗначение Из СоответствиеШаблонов Цикл
			СтруктураШаблона = КлючИЗначение.Ключ.Шаблон.Получить();
			
			// Структура шаблонов.
			СтруктураНастроек.СоответствиеШаблоновИСтруктурыШаблонов.Вставить(КлючИЗначение.Ключ, СтруктураШаблона);
			
			// Добавляем в массив обязательных полей поля, присутствующие в печатной форме ценника.
			Если СтруктураШаблона <> Неопределено
				И ТипЗнч(СтруктураШаблона) = Тип("Структура")
				И СтруктураШаблона.Свойство("ПараметрыШаблона") Тогда
				Для Каждого Элемент Из СтруктураШаблона.ПараметрыШаблона Цикл
					СтруктураНастроек.ОбязательныеПоля.Добавить(Элемент.Ключ);
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
		// Подготовка исходных данных.
		ИсходныеДанные = ПараметрыПечати.ПодарочныеСертификаты.Выгрузить(Новый Структура("Выбран", Истина),
														"Сертификат, НомерСертификата, Штрихкод, КоличествоЭтикеток, ШаблонЭтикетки, Организация");
		Для Каждого СтрокаТЧ Из ИсходныеДанные Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ШаблонЭтикетки) Тогда
				СтрокаТЧ.КоличествоЭтикеток = 0;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли РежимПечати = "ДисконтныеКарты" 
		ИЛИ РежимПечати = "РегистрационныеКарты" Тогда
		
		Если РежимПечати = "РегистрационныеКарты" Тогда
			СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблонаРегистрационнаяКарта";
		Иначе
			СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблонаДисконтнаяКарта";
		КонецЕсли;
		
		ТекстВременнойТаблицы = "	(ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Справочник.ИнформационныеКарты.ПустаяСсылка) КАК Карта,
		|		ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация)";
		
		СтруктураНастроек.Вставить("ТекстВременнойТаблицы", ТекстВременнойТаблицы);
		
		СтруктураНастроек.ОбязательныеПоля.Добавить("Карта");
		СтруктураНастроек.ОбязательныеПоля.Добавить("Организация");
		СтруктураНастроек.ОбязательныеПоля.Добавить("КоличествоЭтикетокДляПечати");
		СтруктураНастроек.ОбязательныеПоля.Добавить("ШаблонЭтикеткиДляПечати");
		
		СтруктураНастроек.ПараметрыДанных.Вставить("Магазин", ПараметрыПечати.Магазин);
		
		ПечататьЭтикетки = Истина;
		ПечататьЦенники = Ложь;
		Если РежимПечати = "РегистрационныеКарты" Тогда
			ТаблицаШаблонов = ПараметрыПечати.РегистрационныеКарты.Выгрузить(Новый Структура("Выбран", Истина), "ШаблонЭтикетки");
		Иначе
			ТаблицаШаблонов = ПараметрыПечати.ДисконтныеКарты.Выгрузить(Новый Структура("Выбран", Истина), "ШаблонЭтикетки");
		КонецЕсли;
		
		Для Каждого СтрокаТЧ Из ТаблицаШаблонов Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.ШаблонЭтикетки) Тогда
				СоответствиеШаблонов.Вставить(СтрокаТЧ.ШаблонЭтикетки);
			КонецЕсли;
		КонецЦикла;
		
		// Заполняем коллекцию обязательных полей и формируем соответствие шаблонов.
		Для Каждого КлючИЗначение Из СоответствиеШаблонов Цикл
			СтруктураШаблона = КлючИЗначение.Ключ.Шаблон.Получить();
			
			// Структура шаблонов.
			СтруктураНастроек.СоответствиеШаблоновИСтруктурыШаблонов.Вставить(КлючИЗначение.Ключ, СтруктураШаблона);
			
			// Добавляем в массив обязательных полей поля, присутствующие в печатной форме ценника.
			Если СтруктураШаблона <> Неопределено
				И ТипЗнч(СтруктураШаблона) = Тип("Структура")
				И СтруктураШаблона.Свойство("ПараметрыШаблона") Тогда
				Для Каждого Элемент Из СтруктураШаблона.ПараметрыШаблона Цикл
					СтруктураНастроек.ОбязательныеПоля.Добавить(Элемент.Ключ);
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
		// Подготовка исходных данных.
		Если РежимПечати = "РегистрационныеКарты" Тогда
			ИсходныеДанные = ПараметрыПечати.РегистрационныеКарты.Выгрузить(
															Новый Структура("Выбран", Истина),
															"Карта, Штрихкод, КоличествоЭтикеток, ШаблонЭтикетки, Организация");
		Иначе
			ИсходныеДанные = ПараметрыПечати.ДисконтныеКарты.Выгрузить(
															Новый Структура("Выбран", Истина),
															"Карта, Штрихкод, КоличествоЭтикеток, ШаблонЭтикетки, Организация");
		КонецЕсли;
		
		Для Каждого СтрокаТЧ Из ИсходныеДанные Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ШаблонЭтикетки) Тогда
				СтрокаТЧ.КоличествоЭтикеток = 0;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли РежимПечати = "ЭтикеткаКодМаркировкиИСМП" Тогда
		
		ПечатьЭтикетокИСМПРТ.ПриПечати(КоллекцияПечатныхФорм, ПараметрыПечати, ОбъектыПечати);
		Возврат;
	Иначе
		СтруктураНастроек.ОбязательныеПоля.Добавить("КоличествоЦенниковДляПечати");
		СтруктураНастроек.ОбязательныеПоля.Добавить("КоличествоЭтикетокДляПечати");
		СтруктураНастроек.ОбязательныеПоля.Добавить("ШаблонЦенникаДляПечати");
		СтруктураНастроек.ОбязательныеПоля.Добавить("ШаблонЭтикеткиДляПечати");
		СтруктураНастроек.ОбязательныеПоля.Добавить("Номенклатура");
		СтруктураНастроек.ОбязательныеПоля.Добавить("НаименованиеПолное");
		СтруктураНастроек.ОбязательныеПоля.Добавить("ШтрихАвтопроверки");
		Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда
			СтруктураНастроек.ОбязательныеПоля.Добавить("Характеристика");
		КонецЕсли;
		Если ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры") Тогда
			СтруктураНастроек.ОбязательныеПоля.Добавить("Упаковка");
		КонецЕсли;
		
		СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблона1";
		ИспользоватьАссортимент = ПолучитьФункциональнуюОпцию("УстанавливатьВидыЦенВАссортименте")
									И АссортиментСервер.ПолучитьФункциональнуюОпциюКонтроляАссортимента(ПараметрыПечати.Магазин);
		Если ИспользоватьАссортимент Тогда
			ФорматМагазина = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыПечати.Магазин, "ФорматМагазина");
			СтруктураНастроек.ПараметрыДанных.Вставить("ФорматМагазина", ФорматМагазина);
		КонецЕсли;
		
		// Собираем используемые поля из шаблонов.
		ТаблицаШаблонов = ПараметрыПечати.Товары.Выгрузить(Новый Структура("Выбран", Истина), "ШаблонЭтикетки, ШаблонЦенника");
		
		ПечататьЭтикетки = Истина;
		ПечататьЦенники = Истина;
		Если КоллекцияПечатныхФорм.Количество() > 0 Тогда
			ПечататьЦенники = КоллекцияПечатныхФорм[0].ИмяМакета = "Ценники";
			ПечататьЭтикетки = КоллекцияПечатныхФорм[0].ИмяМакета = "Этикетки";
		КонецЕсли;
		
		Для Каждого СтрокаТЧ Из ТаблицаШаблонов Цикл
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ШаблонЭтикетки) И ПечататьЭтикетки И СтрокаТЧ.ШаблонЭтикетки.ТипШаблона <> Перечисления.ТипыШаблонов.ЭтикеткаЦенникПринтераЭтикеток Тогда
				СоответствиеШаблонов.Вставить(СтрокаТЧ.ШаблонЭтикетки);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ШаблонЦенника) И ПечататьЦенники И СтрокаТЧ.ШаблонЦенника.ТипШаблона <> Перечисления.ТипыШаблонов.ЭтикеткаЦенникПринтераЭтикеток Тогда
				СоответствиеШаблонов.Вставить(СтрокаТЧ.ШаблонЦенника);
			КонецЕсли;
			
		КонецЦикла;
		
		// Заполняем коллекцию обязательных полей и формируем соответствие шаблонов.
		Для Каждого КлючИЗначение Из СоответствиеШаблонов Цикл
			СтруктураШаблона = КлючИЗначение.Ключ.Шаблон.Получить();
			
			// Структура шаблонов.
			СтруктураНастроек.СоответствиеШаблоновИСтруктурыШаблонов.Вставить(КлючИЗначение.Ключ, СтруктураШаблона);
			
			// Добавляем в массив обязательных полей поля, присутствующие в печатной форме ценника.
			Если СтруктураШаблона <> Неопределено
				И ТипЗнч(СтруктураШаблона) = Тип("Структура")
				И СтруктураШаблона.Свойство("ПараметрыШаблона") Тогда
				Для Каждого Элемент Из СтруктураШаблона.ПараметрыШаблона Цикл
					СтруктураНастроек.ОбязательныеПоля.Добавить(Элемент.Ключ);
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
		// Подготовка исходных данных.
		ИсходныеДанные = ПараметрыПечати.Товары.Выгрузить(Новый Структура("Выбран", Истина),
										"Номенклатура, Справка2, Характеристика, Упаковка, КоличествоЭтикеток, КоличествоЦенников, ШаблонЭтикетки, ШаблонЦенника, Организация, ШтрихАвтопроверки");
		Для Каждого СтрокаТЧ Из ИсходныеДанные Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ШаблонЭтикетки) Тогда
				СтрокаТЧ.КоличествоЭтикеток = 0;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ШаблонЦенника) Тогда
				СтрокаТЧ.КоличествоЦенников = 0;
			КонецЕсли;
		КонецЦикла;
		Если ПараметрыПечати.Режим = "ПечатьЭтикеток" Тогда
			ИсходныеДанные.ЗаполнитьЗначения(0,"КоличествоЦенников");
		КонецЕсли;
		Если ПараметрыПечати.Режим = "ПечатьЦенников" Тогда
			ИсходныеДанные.ЗаполнитьЗначения(0,"КоличествоЭтикеток");
		КонецЕсли;
		
		СтруктураНастроек.ПараметрыДанных.Вставить("ВидЦены", ПараметрыПечати.ВидЦены);
		СтруктураНастроек.ПараметрыДанных.Вставить("Магазин", ПараметрыПечати.Магазин);
		СтруктураНастроек.ПараметрыДанных.Вставить("ПравилоЦенообразования", ПараметрыПечати.ПравилоЦенообразования);
		СтруктураНастроек.ПараметрыДанных.Вставить("МагазинДляЦен", ПараметрыПечати.Магазин);
		СтруктураНастроек.ПараметрыДанных.Вставить("ЦеныПоВидуЦены", ПараметрыПечати.ЦеныПоВидуЦены);
		СтруктураНастроек.ПараметрыДанных.Вставить("ЦеныНаДату", ПараметрыПечати.ЦеныНаДату);
		СтруктураНастроек.ПараметрыДанных.Вставить("ЦеныНазначенныеДействующие", ПараметрыПечати.ЦеныНазначенныеДействующие);
		СтруктураНастроек.ПараметрыДанных.Вставить("ВидМинимальныхЦенПродажи", ПараметрыПечати.ВидМинимальныхЦенПродажи);
		СтруктураНастроек.ПараметрыДанных.Вставить("ЦеныМинимальные", ПараметрыПечати.УчитыватьЦеныМинимальные);
		СтруктураНастроек.ПараметрыДанных.Вставить("ИспользоватьАссортимент", ИспользоватьАссортимент);
		СтруктураНастроек.ПараметрыДанных.Вставить("ИспользоватьСправкиБ", ПараметрыПечати.ИспользоватьСправкиБ);
		
	КонецЕсли;
	
	СтруктураНастроек.ИсходныеДанные = ИсходныеДанные;
	
	// Вывод табличных документов в коллекцию.
	КоллекцияПечатныхФормВнутренняя = СформироватьПечатныеФормыЭтикетокИЦенников(СтруктураНастроек, ПечататьЭтикетки, ПечататьЦенники);
	КоллекцияПечатныхФорм.Очистить();
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФормВнутренняя Цикл
		
		НоваяФорма = КоллекцияПечатныхФорм.Добавить();
		НоваяФорма.ИмяМакета         = ПечатнаяФорма.ИмяМакета;
		НоваяФорма.СинонимМакета     = ПечатнаяФорма.ИмяМакета;
		НоваяФорма.ИмяВРЕГ           = ВРег(ПечатнаяФорма.ИмяМакета);
		НоваяФорма.ТабличныйДокумент = ПечатнаяФорма.ТабличныйДокумент;
		НоваяФорма.Экземпляров       = 1;
		
КонецЦикла;

КонецПроцедуры
