
&После("ОбработкаПроведения")
Процедура УЦ_ОбработкаПроведения(Отказ, РежимПроведения)  
	
КонецПроцедуры  

&НаСервере
Функция СформироватьШтрихкодEAN13()
	
	Возврат ПодключаемоеОборудованиеРТ.СформироватьШтрихкод();
	
КонецФункции


&После("ПередЗаписью")
Процедура УЦ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//	для каждого строка из Товары цикл 
	//	УстановкаЦен = Строка.УстановкаЦен;
	//конеццикла;   
	если РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		если УстановкаЦен = Документы.УстановкаЦенНоменклатуры.ПустаяСсылка() тогда
			Документ = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();  
		иначе
			Документ = УстановкаЦен.получитьобъект();
		конецесли;
		Документ.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Документ.ДокументОснование = ссылка; 
		Документ.дата = Дата - 1;
		Документ.Согласован = истина;    
		Документ.записать(РежимЗаписиДокумента.Запись);  
		УстановкаЦен = Документ.Ссылка;
		НСтрока = Документ.ВидыЦен.Добавить();    
		НСтрока.ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию("Розничная");
		для каждого строка из Товары цикл	
			если ЗначениеЗаполнено(строка.РозничнаяЦена) и Строка.УстановкаЦен = Документы.УстановкаЦенНоменклатуры.ПустаяСсылка() тогда 
				НСтрока = Документ.Товары.Добавить();
				Нстрока.ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию("Розничная");
				Нстрока.Номенклатура = Строка.Номенклатура;
				Нстрока.Характеристика = Строка.Характеристика;
				Нстрока.Упаковка = Строка.Упаковка;
				Нстрока.Цена  = Строка.РозничнаяЦена;	  
				Строка.УстановкаЦен = Документ.Ссылка;
				//ШК   
				если строка.НуженНовыйШК тогда
					Штрихкод = СформироватьШтрихкодEAN13();		
					ШК1 = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
					ШК = ШК1.Добавить();
					ШК.Владелец = строка.Номенклатура;           
					ШК.Характеристика = Строка.Характеристика;
					ШК.Упаковка = Строка.Упаковка;
					ШК.Штрихкод = Штрихкод; 
					ШК.ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
					ШК1.Записать(ложь);	    
				конецесли;
			конецесли;
		конеццикла;   
		если Документ.товары.количество() > 0 тогда
			//попытка
			//	Документ.записать(РежимЗаписиДокумента.Проведение); 
			//	Сообщить("Создан документ: " + Строка(Документ.ссылка));
			//исключение 
				Документ.записать(РежимЗаписиДокумента.Запись);    
				Сообщить("Создан документ: " + Строка(Документ.ссылка));//+ " НО НЕ ПРОВЕДЕН!");
			//конецпопытки;   
		конецесли; 
	конецеслИ;
КонецПроцедуры

