
&НаКлиенте
Процедура УЦ_ТоварыРозничнаяЦенаПриИзмененииПосле(Элемент)
	текданные = элементы.Товары.ТекущиеДанные;
	текданные.УстановкаЦен = вернутьпустуюустановку(текданные.УстановкаЦен,текданные.Номенклатура,текданные.Характеристика);
КонецПроцедуры   

&НаСервере
Функция вернутьпустуюустановку(установка,номен, харак)  
	если установка <> Документы.УстановкаЦенНоменклатуры.ПустаяСсылка() тогда    
		Структура = новый Структура;
		Структура.Вставить("Номенклатура",номен);
		Структура.Вставить("Характеристика",харак);	
		Док = установка.получитьобъект(); 
		НайденныеСтроки = Док.Товары.НайтиСтроки(Структура); 
		если НайденныеСтроки.количество() > 0 тогда
			Док.Товары.Удалить(НайденныеСтроки[0].НомерСтроки - 1);	   
			попытка
				Док.записать(РежимЗаписиДокумента.Проведение); 
				//Сообщить("Создан документ: " + Строка(Документ.ссылка));
			исключение 
				Док.записать(РежимЗаписиДокумента.Запись);    
				//Сообщить("Создан документ: " + Строка(Документ.ссылка) + " НО НЕ ПРОВЕДЕН!");
			конецпопытки; 
		конецесли;
		возврат Документы.УстановкаЦенНоменклатуры.ПустаяСсылка(); 
	конецесли;
конецФункции
